In [ ]:
#  Criar um dataframe utilizando a biblioteca pandas para os seguintes dados:
#   Nomes: Alice, Julia,Bruna, Daniel, Filipe, Silvio.
#   Idade:    19, 22, 28,34,28,48
#   Profissões: Direito, Engenharia, Enfermagem, Engenheiro Civil, Cientista da Computação, Engenheiro 
#   Eletrônico: ID: 1,2,3,4,5,6

# Importa a biblioteca pandas
import pandas as pd

# Define os dados como dicionário
dados = {
    'ID': [1, 2, 3, 4, 5, 6],
    'Nome': ['Alice', 'Julia', 'Bruna', 'Daniel', 'Filipe', 'Silvio'],
    'Idade': [19, 22, 28, 34, 28, 48],
    'Profissão': [
        'Direito',
        'Engenharia',
        'Enfermagem',
        'Engenheiro Civil',
        'Cientista da Computação',
        'Engenheiro Eletrônico'
    ]
}

# Cria o DataFrame
df = pd.DataFrame(dados)

# Aplica estilo para alinhar todas as colunas à esquerda
df.style.set_properties(**{'text-align': 'left'})

In [ ]:
#  Criar um dataframe utilizando a biblioteca pandas para os seguintes dados:
#  Número de produtos fabricados: 50,30,40,100
#  Setores: 1,2,3,4

# Importa a biblioteca pandas
import pandas as pd

# Dados
dados = {
    'Setor': [1, 2, 3, 4],
    'Produtos Fabricados': [50, 30, 40, 100]
}

# Cria o DataFrame
df = pd.DataFrame(dados)

# Aplica estilo para alinhar à esquerda
df.style.set_table_styles(
    [{'selector': 'td', 'props': [('text-align', 'left')]},
     {'selector': 'th', 'props': [('text-align', 'left')]}]
)

In [ ]:
# Você tem disponível dois conjuntos de dados, um com o ID, nome dos funcionários e setores, o outro com 
# id e o salário dos funcionários. Juntar os dois dataframes utilizando a função merge para transformar em um 
# único dataframe utilizando a função merge
#  ID: 1,2,3,4,
#  Nome: Ana, Pedro, Maria, João
#  Setores: Rh,Vendas, Administrativo, Produção
#  Dataframe 2
#  ID: 1,2,3,4
#  Salários: 3000,2800,3200,2500

import pandas as pd

# Dados dos funcionários
dados_funcionarios = {
    'ID': [1, 2, 3, 4],
    'Nome': ['Ana', 'Pedro', 'Maria', 'João'],
    'Setor': ['RH', 'Vendas', 'Administrativo', 'Produção']
}

df_funcionarios = pd.DataFrame(dados_funcionarios)

# Dados dos salários
dados_salarios = {
    'ID': [1, 2, 3, 4],
    'Salário': [3000, 2800, 3200, 2500]
}

df_salarios = pd.DataFrame(dados_salarios)

# Junta os dois DataFrames
df_completo = pd.merge(df_funcionarios, df_salarios, on='ID')

# Aplica estilo com alinhamento à esquerda em tudo
df_completo.style.set_table_styles([
    {'selector': 'th', 'props': [('text-align', 'left')]},   # cabeçalhos
    {'selector': 'td', 'props': [('text-align', 'left')]}    # células
])

In [9]:
# Criar dois dataframes com dados de vendas de uma empresa
#  Data         Produto  Quantidade  Valor
#  2023-01-01   Item A   10         100.00
#  2023-01-02   Item B   5          50.00
#  2023-01-03   Item A   8          80.00
#  Data         Produto  Quantidade  Valor
#  2023-02-01   Item C   12         120.00
#  2023-02-02   Item B   6          60.00
#  2023-02-03   Item D   3          30.00

import pandas as pd

# Primeiro DataFrame: vendas de janeiro
dados_janeiro = {
    'Data': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Produto': ['Item A', 'Item B', 'Item A'],
    'Quantidade': [10, 5, 8],
    'Valor': [100.00, 50.00, 80.00]
}

df_janeiro = pd.DataFrame(dados_janeiro)

# Segundo DataFrame: vendas de fevereiro
dados_fevereiro = {
    'Data': ['2023-02-01', '2023-02-02', '2023-02-03'],
    'Produto': ['Item C', 'Item B', 'Item D'],
    'Quantidade': [12, 6, 3],
    'Valor': [120.00, 60.00, 30.00]
}

df_fevereiro = pd.DataFrame(dados_fevereiro)

# Junta os dois DataFrames
df_vendas = pd.concat([df_janeiro, df_fevereiro], ignore_index=True)

# Aplica estilo para alinhar todo o conteúdo à esquerda
df_vendas.style.set_table_styles([
    {'selector': 'th', 'props': [('text-align', 'left')]},  # cabeçalhos
    {'selector': 'td', 'props': [('text-align', 'left')]}   # células
])